frameworkEverisAPI/lib/xmlExemplo.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.osg.app.bsbr.altec.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:AnalyzeTransaction>
         <request>
            <parameters>
               <entry>
                  <key>2210</key>
                  <value>
                     <item>77.0.3865.120</item>
                  </value>
               </entry>
               <entry>
                  <key>1000</key>
                  <value>
                     <item>0033</item>
                  </value>
               </entry>
               <entry>
                  <key>2000</key>
                  <value>
                     <item>172.16.236.34</item>
                  </value>
               </entry>
               <entry>
                  <key>110</key>
                  <value>
                     <item>009</item>
                  </value>
               </entry>
               <entry>
                  <key>100</key>
                  <value>
                     <item>00107853</item>
                  </value>
               </entry>
               <entry>
                  <key>1</key>
                  <value>
                     <item>93</item>
                  </value>
               </entry>
               <entry>
                  <key>2</key>
                  <value>
                     <item>U154</item>
                  </value>
               </entry>
               <entry>
                  <key>102</key>
                  <value>
                     <item>50399757910</item>
                  </value>
               </entry>
               <entry>
                  <key>113</key>
                  <value>
                     <item>M</item>
                  </value>
               </entry>
               <entry>
                  <key>1400</key>
                  <value>
                     <item>300000</item>
                  </value>
               </entry>
               <entry>
                  <key>4</key>
                  <value>
                     <item>06201930417372283388677</item>
                  </value>
               </entry>
               <entry>
                  <key>5</key>
                  <value>
                     <item>106</item>
                  </value>
               </entry>
               <entry>
                  <key>104</key>
                  <value>
                     <item>F</item>
                  </value>
               </entry>
               <entry>
                  <key>1002</key>
                  <value>
                     <item>000020090790</item>
                  </value>
               </entry>
               <entry>
                  <key>2003</key>
                  <value>
                     <item>10.0</item>
                  </value>
               </entry>
               <entry>
                  <key>6</key>
                  <value>
                     <item>ONOME QUEQUISER</item>
                  </value>
               </entry>
               <entry>
                  <key>1001</key>
                  <value>
                     <item>0001</item>
                  </value>
               </entry>
               <entry>
                  <key>2002</key>
                  <value>
                     <item>windows</item>
                  </value>
               </entry>
               <entry>
                  <key>7</key>
                  <value>
                     <item>176665</item>
                  </value>
               </entry>
               <entry>
                  <key>8</key>
                  <value>
                     <item>AC10EB2B3BA95B70</item>
                  </value>
               </entry>
               <entry>
                  <key>9</key>
                  <value>
                     <item>2019-10-31 18:37:42.014</item>
                  </value>
               </entry>
               <entry>
                  <key>1707</key>
                  <value>
                     <item>172.16.235.183</item>
                  </value>
               </entry>
               <entry>
                  <key>2209</key>
                  <value>
                     <item>CH</item>
                  </value>
               </entry>
            </parameters>
         </request>
      </web:AnalyzeTransaction>
   </soapenv:Body>
</soapenv:Envelope>
